<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Identifier</key>
	<string>com.github.dlclary.munki.cdef</string>
	<key>ParentRecipe</key>
	<string>com.github.dlclary.download.cdef</string>
	<key>Description</key>
	<string>Imports cdef into Munki</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>cdef</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>utilities</string>
		<key>MUNKI_CATEGORY</key>
		<string>Utilities</string>
		<key>MUNKI_DEVELOPER</key>
		<string>Francois Tiffreau</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>command line tool for managing default applications</string>
			<key>developer</key>
			<string>%MUNKI_DEVELOPER%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
